:PROPERTIES:
:ID:       bdae77b1-d9f0-4d3a-a2fb-2ecdab5fd531
:END:
#+title: Linux

*** SysFS

Why use Linux?

Because you can turn the =sysfs= filetree into json & pipe into =jq= ... etc

#+begin_src sh :results output
tree -L 2 \
     --prune --matchdirs \
     -P '[aeiou]*' /sys \
    | head -n42

# tree --json # to get json
#+end_src

#+RESULTS:
#+begin_example
/sys
├── bus
│   ├── acpi
│   ├── auxiliary
│   ├── edac
│   ├── event_source
│   ├── i2c
│   ├── isa
│   ├── usb
│   └── usb-serial
├── class
│   ├── accel
│   ├── ata_device
│   ├── ata_link
│   ├── ata_port
│   ├── extcon
│   ├── i2c-adapter
│   ├── i2c-dev
│   ├── input
│   ├── intel_scu_ipc
│   ├── iommu
│   └── usbmisc
├── devices
│   ├── amd_iommu_0
│   ├── ibs_fetch
│   ├── ibs_op
│   ├── isa
│   └── uprobe
├── firmware
│   ├── acpi
│   └── efi
├── fs
│   └── ext4
├── kernel
│   ├── address_bits
│   ├── iommu_groups
│   ├── irq
│   ├── oops_count
│   └── uevent_seqnum
├── module
│   ├── acpi
│   ├── acpi_cpufreq
#+end_example

#+begin_src sh

tree -L 1 \
     --prune --matchdirs \
     -P '[aeiou]*' /sys \
    | head

# tree --json
#+end_src

